soap-attachment/src/test/resources/xml/soap-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns2="urn:switchyard-quickstart:soap-binding-rpc:1.0">
    <S:Body>
        <ns2:sayHello>
            <toWhom>SwitchYard</toWhom>
            <language>English</language>
        </ns2:sayHello>
    </S:Body>
</S:Envelope>
